//Проверить, что в массиве все элементы упорядочены по возрастанию, т.е. все пары элементов Xi и Xi+1 удовлетворяют условию Xi < Xi+1. Если есть
// пара элементов, не удовлетворяющая условию, найти её номер i.
#include <stdio.h>

int main() {
    int n;

    do {
        printf("Ââåäèòå ðàçìåð ìàññèâà (n): ");
        scanf("%d", &n);
    } while (n <= 0 || n >= 20);

    int A[n];
    printf("Ââåäèòå ýëåìåíòû ìàññèâà:\n");
    for (int i = 0; i < n; i++) {
        scanf("%d", &A[i]);
    }
    printf("Ââåäåííûå ýëåìåíòû ìàññèâà:");
    for (int i = 0; i < n; i++) {
        printf(" %d ", A[i]);
    }

    int flag = 1; // Ôëàã äëÿ îòñëåæèâàíèÿ ñîðòèðîâêè
    for (int i = 1; i < n; i++) {
        if (A[i] < A[i - 1]) {
            if (flag) {
                printf("\nÌàññèâ íå îòñîðòèðîâàí\n");
                flag = 0;
            }
            printf("Íà ïîçèöèè %d íàðóøåíèå: %d\n", i, A[i]);
        }
    }

    if (flag) {
        printf("\n Ìàññèâ îòñîðòèðîâàí ïî âîçðàñòàíèþ.\n");
    }

    return 0;
}
