//Для массива из 2 строк и 10 столбцов напечатать каждый элемент 1-ой строки, который больше находящегося в одном с ним столбце элемента 2-ой строки, и 
//число таких случаев.

#include <stdio.h>

int main() {
    int A[2][10];
    int count = 0;

    printf("ââåäèòå ýëåìåíòû: ");
    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 10; j++) {
            scanf("%i", &A[i][j]);
        }
    }
    printf("Ýëåìåíòû ïåðâîé ñòðîêè, áîëüøå ñîîòâåòñòâóþùèõ ýëåìåíòîâ âòîðîé ñòðîêè:\n");
    for (int j = 0; j < 10; j++) {
        if (A[0][j] > A[1][j]) {
            printf("%i", A[0][j]);
            count++;
        }

    }
    printf("\nêîë-âî %i\n", count);

    return 0;
}
